lucasnz/sn_esp32/src/main.cpp
  // <discovery_prefix>/<component>/[<node_id>/]<object_id>/config
  String discoveryTopic = "homeassistant/light/" + spaSerialNumber + "/" + spaSerialNumber + "-" + propertyId + "/config";
  String output = "";
  serializeJson(json,output);
  mqttClient.publish(discoveryTopic.c_str(),output.c_str(),true);

}
*/

void mqttHaAutoDiscovery() {
  debugI("Publishing Home Assistant auto discovery");

  String output;
  String discoveryTopic;

  SpaAdConfig spa;
  spa.spaName = spaName;
  spa.spaSerialNumber = spaSerialNumber;
  spa.stateTopic = mqttStatusTopic;
  spa.availabilityTopic = mqttAvailability;

  //sensorADPublish("Water Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.water }}","measurement","WaterTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Heater Temperature","diagnostic","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heater }}","measurement","HeaterTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Case Temperature","diagnostic","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.case }}","measurement","CaseTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Mains Voltage","diagnostic","voltage",mqttStatusTopic,"V","{{ value_json.power.voltage }}","measurement","MainsVoltage", spaName, spaSerialNumber);
  //sensorADPublish("Mains Current","diagnostic","current",mqttStatusTopic,"A","{{ value_json.power.current }}","measurement","MainsCurrent", spaName, spaSerialNumber);
  //sensorADPublish("Power","","energy",mqttStatusTopic,"W","{{ value_json.power.energy }}","measurement","Power", spaName, spaSerialNumber);
  //sensorADPublish("Total Energy","","energy",mqttStatusTopic,"Wh","{{ value_json.totalenergy }}","total_increasing","TotalEnergy", spaName, spaSerialNumber);
  //sensorADPublish("Heatpump Ambient Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heatpumpAmbient }}","measurement","HPAmbTemp", spaName, spaSerialNumber);
  //sensorADPublish("Heatpump Condensor Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heatpumpCondensor }}","measurement","HPCondTemp", spaName, spaSerialNumber);
  //sensorADPublish("State","","",mqttStatusTopic,"","{{ value_json.status.state }}","","State", spaName, spaSerialNumber);
  spa.commandTopic = mqttSet;
  
  AutoDiscoveryConfig config;

  config.displayName = "Water Temperature";
  config.valueTemplate = "{{ value_json.temperatures.water }}";
  config.propertyId = "WaterTemperature";
  config.deviceClass = "temperature";
  config.entityCategory = "";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "°C");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Case Temperature";
  config.valueTemplate = "{{ value_json.temperatures.case }}";
  config.propertyId = "CaseTemperature";
  config.deviceClass = "temperature";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "°C");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Heater Temperature";
  config.valueTemplate = "{{ value_json.temperatures.heater }}";
  config.propertyId = "HeaterTemperature";
  config.deviceClass = "temperature";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "°C");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Heatpump Ambient Temperature";
  config.valueTemplate = "{{ value_json.temperatures.heatpumpAmbient }}";
  config.propertyId = "HPAmbTemp";
  config.deviceClass = "temperature";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "°C");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Heatpump Condensor Temperature";
  config.valueTemplate = "{{ value_json.temperatures.heatpumpCondensor }}";
  config.propertyId = "HPCondTemp";
  config.deviceClass = "temperature";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "°C");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Mains Voltage";
  config.valueTemplate = "{{ value_json.power.voltage }}";
  config.propertyId = "MainsVoltage";
  config.deviceClass = "voltage";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "V");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Mains Current";
  config.valueTemplate = "{{ value_json.power.current }}";
  config.propertyId = "MainsCurrent";
  config.deviceClass = "current";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "A");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Power";
  config.valueTemplate = "{{ value_json.power.power }}";
  config.propertyId = "Power";
  config.deviceClass = "power";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "W");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Total Energy";
  config.valueTemplate = "{{ value_json.power.totalEnergy }}";
  config.propertyId = "TotalEnergy";
  config.deviceClass = "energy";
  config.entityCategory = "diagnostic";
  generateSensorAdJSON(output, config, spa, discoveryTopic, "measurement", "kWh");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "State";
  config.valueTemplate = "{{ value_json.status.state }}";
  config.propertyId = "State";
  config.deviceClass = "";
  config.entityCategory = "";
  generateSensorAdJSON(output, config, spa, discoveryTopic);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  //binarySensorADPublish("Heating Active","",mqttStatusTopic,"{{ value_json.status.heatingActive }}","HeatingActive", spaName, spaSerialNumber);
  //binarySensorADPublish("Ozone Active","",mqttStatusTopic,"{{ value_json.status.ozoneActive }}","OzoneActive", spaName, spaSerialNumber);
  config.displayName = "Heating Active";
  config.valueTemplate = "{{ value_json.status.heatingActive }}";
  config.propertyId = "HeatingActive";
  config.deviceClass = "heat";
  config.entityCategory = "";
  generateBinarySensorAdJSON(output, config, spa, discoveryTopic);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Ozone Active";
  config.valueTemplate = "{{ value_json.status.ozoneActive }}";
  config.propertyId = "OzoneActive";
  config.deviceClass = "running";
  config.entityCategory = "";
  generateBinarySensorAdJSON(output, config, spa, discoveryTopic);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

